/**
 * 2.c — программа вывода пределов POSIX
 *
 * Copyright (c) <2022> <Гордеев Никита>
 *
 * This code is licensed under a MIT-style license.
 */

#include "apue.h"
#include <stdio.h>
#include <limits.h>

int main()
{
    /* Таблица 2.8. Минимальные значения из файла <limits.h>, определяемые стандартом POSIX.1 */
    printf("\nТаблица 2.8. Минимальные значения из файла <limits.h>, определяемые стандартом POSIX.1\n");
    printf("----------------------------------------------------------------------------------------------------------------------------------------------------------\n");
    printf("Имя                     | Описание: минимально допустимое значение для максимального значения..                       | Значение \n");
    printf("----------------------------------------------------------------------------------------------------------------------------------------------------------\n");
    printf("_POSIX_ARG_MAX          | Длины аргументов функций exec                                                               | %d\n", _POSIX_ARG_MAX);
    printf("----------------------------------------------------------------------------------------------------------------------------------------------------------\n");
    printf("_POSIX_CHILD_MAX        | Количества дочерних процессов на реальный идентификатор пользователя                        | %d\n", _POSIX_CHILD_MAX);
    printf("----------------------------------------------------------------------------------------------------------------------------------------------------------\n");
    printf("_POSIX_DELAYTIMER_MAX   | Количества переполнений каждого таймера                                                     | %d\n", _POSIX_LINK_MAX);
    printf("----------------------------------------------------------------------------------------------------------------------------------------------------------\n");
    printf("_POSIX_HOST_NAME_MAX    | Длины имени сетевого узла, возвращаемого функцией gethostname                               | %d\n", _POSIX_HOST_NAME_MAX);
    printf("----------------------------------------------------------------------------------------------------------------------------------------------------------\n");
    printf("_POSIX_LINK_MAX         | Количества ссылок на один файл                                                              | %d\n", _POSIX_LINK_MAX);
    printf("----------------------------------------------------------------------------------------------------------------------------------------------------------\n");
    printf("_POSIX_LOGIN_NAME_MAX   | Длины имени пользователя                                                                    | %d\n", _POSIX_LOGIN_NAME_MAX);
    printf("----------------------------------------------------------------------------------------------------------------------------------------------------------\n");
    printf("_POSIX_MAX_CANON        | Количества байтов в канонической входной очереди терминала                                  | %d\n", _POSIX_MAX_CANON);
    printf("----------------------------------------------------------------------------------------------------------------------------------------------------------\n");
    printf("_POSIX_MAX_INPUT        | Количества байтов, доступных во входной очереди терминала                                   | %d\n", _POSIX_MAX_INPUT);
    printf("----------------------------------------------------------------------------------------------------------------------------------------------------------\n");
    printf("_POSIX_NAME_MAX         | Количества байтов в имени файла, за исключением завершающего нулевого символа               | %d\n", _POSIX_NAME_MAX);
    printf("----------------------------------------------------------------------------------------------------------------------------------------------------------\n");
    printf("_POSIX_NGROUPS_MAX      | Количества идентификаторов дополнительных групп на процесс                                  | %d\n", _POSIX_NGROUPS_MAX);
    printf("----------------------------------------------------------------------------------------------------------------------------------------------------------\n");
    printf("_POSIX_OPEN_MAX         | Количества открытых файлов на процесс                                                       | %d\n", _POSIX_OPEN_MAX);
    printf("----------------------------------------------------------------------------------------------------------------------------------------------------------\n");
    printf("_POSIX_PATH_MAX         | Длины строки пути к файлу, включая завершающий нулевой символ                               | %d\n", _POSIX_PATH_MAX);
    printf("----------------------------------------------------------------------------------------------------------------------------------------------------------\n");
    printf("_POSIX_PIPE_BUF         | Количества байтов, которые можно атомарно записать в канал                                  | %d\n", _POSIX_PIPE_BUF);
    printf("----------------------------------------------------------------------------------------------------------------------------------------------------------\n");
    printf("_POSIX_RE_DUP_MAX       | Количества повторяющихся вхождений для основного регулярного выражения,                     | %d\n", _POSIX_RE_DUP_MAX );
    printf("                        | принимаемого функциями regexec и regcomp, при использовании интервальной нотации \\{m, n\\}   | \n");
    printf("----------------------------------------------------------------------------------------------------------------------------------------------------------\n");
    printf("_POSIX_RTSIG_MAX        | Количества сигналов реального времени, зарезервированных для приложения                     | %d\n", _POSIX_RTSIG_MAX);
    printf("----------------------------------------------------------------------------------------------------------------------------------------------------------\n");
    printf("_POSIX_SEM_NSEMS_MAX    | Количества семафоров, одновременно используемых процессом                                   | %d\n", _POSIX_SEM_NSEMS_MAX);
    printf("----------------------------------------------------------------------------------------------------------------------------------------------------------\n");
    printf("_POSIX_SEM_VALUE_MAX    | Значения, которые может хранить семафор                                                     | %d\n", _POSIX_SEM_VALUE_MAX);
    printf("----------------------------------------------------------------------------------------------------------------------------------------------------------\n");
    printf("_POSIX_SIGQUEUE_MAX     | Количества сигналов, которые процесс может поставить в очередь ожидания обработки           | %d\n", _POSIX_SIGQUEUE_MAX);
    printf("----------------------------------------------------------------------------------------------------------------------------------------------------------\n");
    printf("_POSIX_SSIZE_MAX        | Значения, которые можно сохранить в переменной типа ssize_t                                 | %d\n", _POSIX_SSIZE_MAX);
    printf("----------------------------------------------------------------------------------------------------------------------------------------------------------\n");
    printf("_POSIX_STREAM_MAX       | Количества стандартных потоков ввода/вывода на процесс                                      | %d\n", _POSIX_STREAM_MAX);
    printf("----------------------------------------------------------------------------------------------------------------------------------------------------------\n");
    printf("_POSIX_SYMLINK_MAX      | Количества байтов в символической ссылке                                                    | %d\n", _POSIX_SYMLINK_MAX);
    printf("----------------------------------------------------------------------------------------------------------------------------------------------------------\n");
    printf("_POSIX_SYMLOOP_MAX      | Количества переходов по символическим ссылкам, допустимого в строке пути                    | %d\n", _POSIX_SYMLOOP_MAX);    
    printf("----------------------------------------------------------------------------------------------------------------------------------------------------------\n");
    printf("_POSIX_TIMER_MAX        | Количества таймеров в процессе                                                              | %d\n", _POSIX_TIMER_MAX);    
    printf("----------------------------------------------------------------------------------------------------------------------------------------------------------\n");
    printf("_POSIX_TTY_NAME_MAX     | Длины имени терминального устройства, включая завершающий нулевой символ                    | %d\n", _POSIX_TTY_NAME_MAX);    
    printf("----------------------------------------------------------------------------------------------------------------------------------------------------------\n");
    printf("_POSIX_TZNAME_MAX       | Количества байтов в имени временной зоны                                                    | %d\n", _POSIX_TZNAME_MAX);    
    printf("----------------------------------------------------------------------------------------------------------------------------------------------------------\n");
    
    /* Таблица 2.9. Значения времени выполнения из файла <limits.h>, определяемые  стандартом POSIX.1 */
    printf("\nТаблица 2.9. Значения времени выполнения из файла <limits.h>, определяемые  стандартом POSIX.1\n");
    printf("----------------------------------------------------------------------------------------------------------------------------------------------------------\n");
    printf("Имя            | Описание                                                                                            | Минимально допустимое значение \n");
    printf("----------------------------------------------------------------------------------------------------------------------------------------------------------\n");
    printf("ARG_MAX        | Максимальная длина аргументов функций семейства exec (в байтах)                                     | %d\n", _POSIX_ARG_MAX);    
    printf("----------------------------------------------------------------------------------------------------------------------------------------------------------\n");
    printf("CHILD_MAX      | Максимальное число дочерних процессов на один реальный идентификатор пользователя                   | %d\n", _POSIX_CHILD_MAX);    
    printf("----------------------------------------------------------------------------------------------------------------------------------------------------------\n");
    printf("DELAYTIMER_MAX |  Максимальное количество переполнений  таймера                                                      | %d\n", _POSIX_DELAYTIMER_MAX);
    printf("----------------------------------------------------------------------------------------------------------------------------------------------------------\n");
    printf("HOST_NAME_MAX  |  Максимальная длина имени сетевого узла, возвращаемого функцией gethostname                         | %d\n", _POSIX_HOST_NAME_MAX);
    printf("----------------------------------------------------------------------------------------------------------------------------------------------------------\n");
    printf("LOGIN_NAME_MAX |  Максимальная длина имени пользователя                                                              | %d\n", _POSIX_LOGIN_NAME_MAX);
    printf("----------------------------------------------------------------------------------------------------------------------------------------------------------\n");
    printf("OPEN_MAX       |  Значение, на единицу больше максимального, которое можно присвоить файловому дескриптору           | %d\n", _POSIX_OPEN_MAX);
    printf("----------------------------------------------------------------------------------------------------------------------------------------------------------\n");
    printf("RTSIG_MAX      |  Максимальное количество сигналов реального  времени, зарезервированных для приложения              | %d\n", _POSIX_RTSIG_MAX);
    printf("----------------------------------------------------------------------------------------------------------------------------------------------------------\n");
    printf("SEM_NSEMS_MAX  |  Максимальное количество семафоров, одновременно используемых процессом                             | %d\n", _POSIX_SEM_NSEMS_MAX);
    printf("----------------------------------------------------------------------------------------------------------------------------------------------------------\n");
    printf("SEM_VALUE_MAX  | Максимальное значение семафора                                                                      | %d\n", _POSIX_SEM_VALUE_MAX);
    printf("----------------------------------------------------------------------------------------------------------------------------------------------------------\n");
    printf("SIGQUEUE_MAX   | Максимальное количество сигналов, которые процесс может поставить в очередь                         | %d\n", _POSIX_SIGQUEUE_MAX);
    printf("----------------------------------------------------------------------------------------------------------------------------------------------------------\n");
    printf("STREAM_MAX     | Максимальное число стандартных потоков ввода/вывода, которые процесс может открыть одновременно     | %d\n", _POSIX_STREAM_MAX);
    printf("----------------------------------------------------------------------------------------------------------------------------------------------------------\n");
    printf("SYMLOOP_MAX    | Максимальное количество символических ссылок, которые можно пройти в процессе  анализа пути к файлу | %d\n", _POSIX_SYMLOOP_MAX);
    printf("----------------------------------------------------------------------------------------------------------------------------------------------------------\n");
    printf("TIMER_MAX      | Максимальное количество таймеров в процессе                                                         | %d\n", _POSIX_TIMER_MAX);
    printf("----------------------------------------------------------------------------------------------------------------------------------------------------------\n");
    printf("TTY_NAME_MAX   | Максимальная длина имени терминального устройства, включая завершающий нулевой символ               | %d\n", _POSIX_TTY_NAME_MAX);
    printf("----------------------------------------------------------------------------------------------------------------------------------------------------------\n");
    printf("TZNAME_MAX     | Количество байтов в имени временной зоны                                                            | %d\n", _POSIX_TZNAME_MAX);
    printf("----------------------------------------------------------------------------------------------------------------------------------------------------------\n");
    
}    





